In [1]:
# Import Packages
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns

In [4]:
# Load the dataset
df = pd.read_csv('tech_companies_salary.csv')
# Display the first few rows of the dataframe
print(df.head())
# Display summary information about the dataframe
df.info

            timestamp    company level                         title  \
0    06-07-2017 11:33     Oracle    L3               Product Manager
1    06-10-2017 17:11       eBay  SE 2             Software Engineer
2    06-11-2017 14:53     Amazon    L7               Product Manager
3   6/17/2017 0:23:14      Apple    M1  Software Engineering Manager
4  6/20/2017 10:58:51  Microsoft    60             Software Engineer

   totalyearlycompensation           location  yearsofexperience  \
0                   127000   Redwood City, CA                1.5
1                   100000  San Francisco, CA                5.0
2                   310000        Seattle, WA                8.0
3                   372000      Sunnyvale, CA                7.0
4                   157000  Mountain View, CA                5.0

   yearsatcompany  tag  basesalary  ...  Doctorate_Degree  Highschool  \
0             1.5  NaN      107000  ...                 0           0
1             3.0  NaN           0  ...                 0           0
2             0.0  NaN      155000  ...                 0           0
3             5.0  NaN      157000  ...                 0           0
4             3.0  NaN           0  ...                 0           0

  Some_College Race_Asian  Race_White  Race_Two_Or_More  Race_Black  \
0            0          0           0                 0           0
1            0          0           0                 0           0
2            0          0           0                 0           0
3            0          0           0                 0           0
4            0          0           0                 0           0

   Race_Hispanic  Race  Education
0              0   NaN        NaN
1              0   NaN        NaN
2              0   NaN        NaN
3              0   NaN        NaN
4              0   NaN        NaN

[5 rows x 29 columns]

<bound method DataFrame.info of                 timestamp     company     level                         title  \
0        06-07-2017 11:33      Oracle        L3               Product Manager
1        06-10-2017 17:11        eBay      SE 2             Software Engineer
2        06-11-2017 14:53      Amazon        L7               Product Manager
3       6/17/2017 0:23:14       Apple        M1  Software Engineering Manager
4      6/20/2017 10:58:51   Microsoft        60             Software Engineer
...                   ...         ...       ...                           ...
62637    09-09-2018 11:52      Google        T4             Software Engineer
62638   9/13/2018 8:23:32   Microsoft        62             Software Engineer
62639  9/13/2018 14:35:59        MSFT        63             Software Engineer
62640  9/16/2018 16:10:35  Salesforce  Lead MTS             Software Engineer
62641   1/29/2019 5:12:59       apple      ict3             Software Engineer

       totalyearlycompensation           location  yearsofexperience  \
0                       127000   Redwood City, CA                1.5
1                       100000  San Francisco, CA                5.0
2                       310000        Seattle, WA                8.0
3                       372000      Sunnyvale, CA                7.0
4                       157000  Mountain View, CA                5.0
...                        ...                ...                ...
62637                   327000        Seattle, WA               10.0
62638                   237000        Redmond, WA                2.0
62639                   220000        Seattle, WA               14.0
62640                   280000  San Francisco, CA                8.0
62641                   200000      Sunnyvale, CA                0.0

       yearsatcompany                             tag  basesalary  ...  \
0                 1.5                             NaN      107000  ...
1                 3.0                             NaN           0  ...
2                 0.0                             NaN      155000  ...
3                 5.0                             NaN      157000  ...
4                 3.0                             NaN           0  ...
...               ...                             ...         ...  ...
62637             1.0  Distributed Systems (Back-End)      155000  ...
62638             2.0                      Full Stack      146900  ...
62639            12.0                      Full Stack      157000  ...
62640             4.0                             iOS      194688  ...
62641             0.0                         ML / AI      155000  ...

       Doctorate_Degree  Highschool Some_College Race_Asian  Race_White  \
0                     0           0            0          0           0
1                     0           0            0          0           0
2                     0           0            0          0           0
3                     0           0            0          0           0
4                     0           0            0          0           0
...                 ...         ...          ...        ...         ...
62637                 0           0            0          0           0
62638                 0           0            0          0           0
62639                 0           0            0          0           0
62640                 0           0            0          0           0
62641                 0           0            0          0           0

       Race_Two_Or_More  Race_Black  Race_Hispanic  Race  Education
0                     0           0              0   NaN        NaN
1                     0           0              0   NaN        NaN
2                     0           0              0   NaN        NaN
3                     0           0              0   NaN        NaN
4                     0           0              0   NaN        NaN
...                 ...         ...            ...   ...        ...
62637                 0           0              0   NaN        NaN
62638                 0           0              0   NaN        NaN
62639                 0           0              0   NaN        NaN
62640                 0           0              0   NaN        NaN
62641                 0           0              0   NaN        NaN

[62642 rows x 29 columns]>

In [5]:
# Number of null values in each column
df.isna().sum()

timestamp                      0
company                        5
level                        123
title                          0
totalyearlycompensation        0
location                       0
yearsofexperience              0
yearsatcompany                 0
tag                          870
basesalary                     0
stockgrantvalue                0
bonus                          0
gender                     19540
otherdetails               22508
cityid                         0
dmaid                          2
rowNumber                      0
Masters_Degree                 0
Bachelors_Degree               0
Doctorate_Degree               0
Highschool                     0
Some_College                   0
Race_Asian                     0
Race_White                     0
Race_Two_Or_More               0
Race_Black                     0
Race_Hispanic                  0
Race                       40215
Education                  32272
dtype: int64

In [6]:
# Count null values in 'gender' column
print(df['gender'].isna().sum())
# Remove rows with null 'gender' column
df = df.dropna(subset='gender')
# Verify removal
print(df.isna().sum())

19540
timestamp                      0
company                        4
level                         72
title                          0
totalyearlycompensation        0
location                       0
yearsofexperience              0
yearsatcompany                 0
tag                          354
basesalary                     0
stockgrantvalue                0
bonus                          0
gender                         0
otherdetails               12915
cityid                         0
dmaid                          1
rowNumber                      0
Masters_Degree                 0
Bachelors_Degree               0
Doctorate_Degree               0
Highschool                     0
Some_College                   0
Race_Asian                     0
Race_White                     0
Race_Two_Or_More               0
Race_Black                     0
Race_Hispanic                  0
Race                       20791
Education                  15336
dtype: int64

In [8]:
# Count null values in 'Education' column
print(df['Education'].isna().sum())
# Remove rows with null 'Education' column
df = df.dropna(subset='Education')
# Verify removal
print(df.isna().sum())

15336
timestamp                     0
company                       2
level                        57
title                         0
totalyearlycompensation       0
location                      0
yearsofexperience             0
yearsatcompany                0
tag                          25
basesalary                    0
stockgrantvalue               0
bonus                         0
gender                        0
otherdetails                  0
cityid                        0
dmaid                         0
rowNumber                     0
Masters_Degree                0
Bachelors_Degree              0
Doctorate_Degree              0
Highschool                    0
Some_College                  0
Race_Asian                    0
Race_White                    0
Race_Two_Or_More              0
Race_Black                    0
Race_Hispanic                 0
Race                       6175
Education                     0
dtype: int64

In [9]:
df.info

<bound method DataFrame.info of                 timestamp      company              level  \
3427   12/28/2018 6:53:55  Capital One   Senior Associate
5037   3/18/2019 10:03:34    Bloomberg  Software Engineer
5392   3/31/2019 16:58:35       Amazon                 L5
6055   4/25/2019 23:33:26        Apple               ICT3
7218     06-12-2019 21:08     Synopsys                100
...                   ...          ...                ...
61981  2/15/2021 19:50:36     Facebook                 M2
61982    03-09-2021 17:03       Google                L10
61984  3/25/2021 10:45:03       Zapier                 L8
61987  5/18/2021 15:34:21     Facebook                 D1
61991  7/30/2021 22:23:24     Facebook                 E9

                              title  totalyearlycompensation  \
3427                 Data Scientist                   125000
5037              Software Engineer                   170000
5392                 Data Scientist                   332000
6055              Software Engineer                   240000
7218              Software Engineer                   310000
...                             ...                      ...
61981  Software Engineering Manager                  1470000
61982               Product Manager                  4500000
61984  Software Engineering Manager                  1605000
61987  Software Engineering Manager                  2372000
61991               Product Manager                  4980000

                location  yearsofexperience  yearsatcompany  \
3427      Washington, DC                1.0             0.0
5037        New York, NY                0.0             0.0
5392       Palo Alto, CA                1.0             0.0
6055       Cupertino, CA                3.0             3.0
7218   Mountain View, CA               25.0             9.0
...                  ...                ...             ...
61981     Menlo Park, CA                9.0             7.0
61982  San Francisco, CA               20.0            14.0
61984         Denver, CO               16.0             2.0
61987     Menlo Park, CA               22.0             2.0
61991     Menlo Park, CA               17.0             0.0

                                  tag  basesalary  ...  Doctorate_Degree  \
3427                          ML / AI      121000  ...                 1
5037   Distributed Systems (Back-End)      142000  ...                 0
5392                     Optimization      185000  ...                 1
6055                          ML / AI      150000  ...                 1
7218                           DevOps      210000  ...                 1
...                               ...         ...  ...               ...
61981                      Full Stack      290000  ...                 0
61982                        Consumer      450000  ...                 0
61984                      Full Stack      250000  ...                 0
61987                         ML / AI      315000  ...                 0
61991                         Product      380000  ...                 0

       Highschool Some_College Race_Asian  Race_White  Race_Two_Or_More  \
3427            0            0          0           0                 0
5037            0            0          0           0                 0
5392            0            0          0           0                 0
6055            0            0          0           0                 0
7218            0            0          0           0                 0
...           ...          ...        ...         ...               ...
61981           0            0          1           0                 0
61982           0            0          1           0                 0
61984           0            0          0           1                 0
61987           0            0          0           0                 0
61991           0            0          1           0                 0

       Race_Black  Race_Hispanic   Race          Education
3427            0              0    NaN                PhD
5037            0              0    NaN    Master's Degree
5392            0              0    NaN                PhD
6055            0              0    NaN                PhD
7218            0              0    NaN                PhD
...           ...            ...    ...                ...
61981           0              0  Asian  Bachelor's Degree
61982           0              0  Asian    Master's Degree
61984           0              0  White    Master's Degree
61987           1              0  Black    Master's Degree
61991           0              0  Asian    Master's Degree

[27766 rows x 29 columns]>

In [10]:
# Count null values in 'company' column
print(df['company'].isna().sum())
# Remove rows with null 'Education' column
df = df.dropna(subset='company')
# Verify removal
print(df.isna().sum())

2
timestamp                     0
company                       0
level                        57
title                         0
totalyearlycompensation       0
location                      0
yearsofexperience             0
yearsatcompany                0
tag                          25
basesalary                    0
stockgrantvalue               0
bonus                         0
gender                        0
otherdetails                  0
cityid                        0
dmaid                         0
rowNumber                     0
Masters_Degree                0
Bachelors_Degree              0
Doctorate_Degree              0
Highschool                    0
Some_College                  0
Race_Asian                    0
Race_White                    0
Race_Two_Or_More              0
Race_Black                    0
Race_Hispanic                 0
Race                       6175
Education                     0
dtype: int64

In [13]:
# Count null values in 'Race' column
print(df['Race'].isna().sum())
# Remove rows with null 'Race' column
df = df.dropna(subset='Race')
# Verify removal
print(df.isna().sum())

6175
timestamp                   0
company                     0
level                      53
title                       0
totalyearlycompensation     0
location                    0
yearsofexperience           0
yearsatcompany              0
tag                        21
basesalary                  0
stockgrantvalue             0
bonus                       0
gender                      0
otherdetails                0
cityid                      0
dmaid                       0
rowNumber                   0
Masters_Degree              0
Bachelors_Degree            0
Doctorate_Degree            0
Highschool                  0
Some_College                0
Race_Asian                  0
Race_White                  0
Race_Two_Or_More            0
Race_Black                  0
Race_Hispanic               0
Race                        0
Education                   0
dtype: int64

In [16]:
# Count null values in 'tag' column
print(df['tag'].isna().sum())
# Remove rows with null 'tag' column
df = df.dropna(subset='tag')
# Verify removal
print(df.isna().sum())

21
timestamp                   0
company                     0
level                      53
title                       0
totalyearlycompensation     0
location                    0
yearsofexperience           0
yearsatcompany              0
tag                         0
basesalary                  0
stockgrantvalue             0
bonus                       0
gender                      0
otherdetails                0
cityid                      0
dmaid                       0
rowNumber                   0
Masters_Degree              0
Bachelors_Degree            0
Doctorate_Degree            0
Highschool                  0
Some_College                0
Race_Asian                  0
Race_White                  0
Race_Two_Or_More            0
Race_Black                  0
Race_Hispanic               0
Race                        0
Education                   0
dtype: int64

In [17]:
df['level'].head(50)

15710                         L6
23532                         61
23533                         L5
23534                         62
23535                        IC3
23537                         L6
23538                     PSG 20
23540                         L7
23541                         L6
23543                       ICT3
23544                    Level 4
23545                         L5
23546                 Senior MTS
23547                        NaN
23548                         L4
23549                    Grade 5
23550                         E4
23552                        T25
23553                 Senior SWE
23554                         59
23555                         62
23556             Staff Engineer
23557                        III
23558                         64
23559                     Senior
23562                         M1
23564                         L3
23565                     03-Jan
23566              Lead Engineer
23567                         E4
23568                  Principal
23574                         L5
23575                       SMTS
23577          Software Engineer
23578                       Sde4
23579      Senior Vice President
23580                         30
23583                   Director
23585                        IC5
23586                         L4
23588                         L6
23590             Senior Manager
23591                         L7
23596                        MTS
23598               Sr Developer
23601                        IC4
23603                      Staff
23604    Staff Software Engineer
23605                         E4
23606                       ICT2
Name: level, dtype: object

In [18]:
len(pd.unique(df['level']))

1596

In [19]:
# Count null values in 'tag' column
print(df['level'].isna().sum())
# Remove rows with null 'tag' column
df = df.dropna(subset='level')
# Verify removal
print(df.isna().sum())

53
timestamp                  0
company                    0
level                      0
title                      0
totalyearlycompensation    0
location                   0
yearsofexperience          0
yearsatcompany             0
tag                        0
basesalary                 0
stockgrantvalue            0
bonus                      0
gender                     0
otherdetails               0
cityid                     0
dmaid                      0
rowNumber                  0
Masters_Degree             0
Bachelors_Degree           0
Doctorate_Degree           0
Highschool                 0
Some_College               0
Race_Asian                 0
Race_White                 0
Race_Two_Or_More           0
Race_Black                 0
Race_Hispanic              0
Race                       0
Education                  0
dtype: int64